#Дана строка. Вывести строку, содержащую те же символы, но расположенные в обратном порядке.
s = 'Готовые программные коды выложены на GitHub'
print(s)
reversed = s [::-1]
print(reversed)


